Тестовая_база_ERP_14/src/InformationRegisters/CRM_СостояниеПользователейСинхронизации/CRM_СостояниеПользователейСинхронизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СостояниеПользователейСинхронизации</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.CRM_СостоянияСинхронизацииПользователя</types>
    </type>
  </resources>
  <resources>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправкиПриглашения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетПодписку</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IMEI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/CRM_СостояниеПользователейСинхронизации/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	УстановитьПривилегированныйРежим(Истина);
	СписокУзлов = Новый СписокЗначений;
	Для Каждого СтрокаЗаписи Из ЭтотОбъект Цикл
		Если СтрокаЗаписи.Идентификатор = "" Тогда
			СтрокаЗаписи.Идентификатор = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;	
		Если СтрокаЗаписи.Пользователь.CRM_ЕмейлДляСинхронизации <> СтрокаЗаписи.ЭлектроннаяПочта Тогда
			ПользовательОбъект = СтрокаЗаписи.Пользователь.ПолучитьОбъект();
			ПользовательОбъект.CRM_ЕмейлДляСинхронизации = СтрокаЗаписи.ЭлектроннаяПочта;
			ПользовательОбъект.ОбменДанными.Загрузка = Истина;
			ПользовательОбъект.ДополнительныеСвойства.Вставить("ДатаИзменения", ТекущаяДата());
			ПользовательОбъект.Записать();
		КонецЕсли;
		КодУзла = СтрокаЗаписи.Идентификатор;
		УзелОбмена = ПланыОбмена.CRM_СинхронизацияСМобильнымПриложениемНовый.НайтиПоКоду(КодУзла);
		Если УзелОбмена.Пустая() Тогда
			УзелОбмена = ПланыОбмена.CRM_СинхронизацияСМобильнымПриложениемНовый.СоздатьУзел();
			УзелОбмена.Код = КодУзла;
			УзелОбмена.Наименование = "Пользователь: "+СтрокаЗаписи.Пользователь+", устройство: "+СтрокаЗаписи.IMEI;
			УзелОбмена.Пользователь = СтрокаЗаписи.Пользователь;
			ИмяФайлаПравил = ПолучитьИмяВременногоФайла("xml");
			Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
				
				МакетПравил = ПланыОбмена.CRM_СинхронизацияСМобильнымПриложениемНовый.ПолучитьМакет("CRM_ПравилаКонвертации");
				
			Иначе 
				
				МакетПравил = ПланыОбмена.CRM_СинхронизацияСМобильнымПриложениемНовый.ПолучитьМакет("УТ_ПравилаКонвертации");
				
			КонецЕсли;
			МакетПравил.Записать(ИмяФайлаПравил);
			ДДПравил = Новый ДвоичныеДанные(ИмяФайлаПравил);
			УзелОбмена.ПравилаОбмена = Новый ХранилищеЗначения(ДДПравил);
			УзелОбмена.Записать();
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(КодУзла);
			МассивПараметров.Добавить(СтрокаЗаписи.Пользователь);
			ФоновоеЗадание = ФоновыеЗадания.Выполнить("CRM_СинхронизацияСiCRMНовый.ЗарегистрироватьНовыйУзелОбмена", МассивПараметров, КодУзла, "Регистрация изменений для узла "+КодУзла);
		КонецЕсли;	
		СписокУзлов.Добавить(УзелОбмена.Ссылка);
	КонецЦикла;	
	Выборка = ПланыОбмена.CRM_СинхронизацияСМобильнымПриложениемНовый.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтотУзел И Выборка.Код = "" Тогда
			Об = Выборка.ПолучитьОбъект();
			Об.Код = "CRM";
			Об.Наименование = "CRM";
			Об.Записать();
		КонецЕсли;	
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	//ЗапросУдаления = Новый Запрос;
	//ЗапросУдаления.Текст = "ВЫБРАТЬ
	//|	CRM_СинхронизацияСМобильнымПриложениемНовый.Ссылка КАК Ссылка
	//|ИЗ
	//|	ПланОбмена.CRM_СинхронизацияСМобильнымПриложениемНовый КАК CRM_СинхронизацияСМобильнымПриложениемНовый
	//|ГДЕ
	//|	НЕ CRM_СинхронизацияСМобильнымПриложениемНовый.Ссылка В (&Ссылка)
	//|	И НЕ CRM_СинхронизацияСМобильнымПриложениемНовый.ЭтотУзел"; 
	//ЗапросУдаления.УстановитьПараметр("Ссылка", СписокУзлов);
	//ТабУзлов = ЗапросУдаления.Выполнить().Выгрузить();
	//Для Каждого СтрокаУзла Из ТабУзлов Цикл 
	//	НаборРегистра = РегистрыСведений.CRM_ДанныеДляВыгрузкиВiCRM.СоздатьНаборЗаписей();
	//	НаборРегистра.Отбор.УзелОбмена.Установить(СтрокаУзла.Ссылка);
	//	НаборРегистра.Записать(Истина);
	//	ОбУзла = СтрокаУзла.Ссылка.ПолучитьОбъект();
	//	ОбУзла.Удалить();
	//КонецЦикла;			
КонецПроцедуры
